<?php

namespace Database\Seeders;

use App\Models\News;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class NewsSeeder extends Seeder
{
  /**
   * Run the database seeds.
   *
   * @return void
   */
  public function run()
  {
    News::create([
      'title' => [
        'ar' => 'مشروع تحديث أنظمة البنك',
        'en' => 'english',
      ],
      'description' => [
        'ar' => 'هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى هذا النص هو مثال لنص يمكن أن يستبدل',
        'en' => 'english',
      ],
      'image' => '16582236787836878523589890043228.jpg',
    ]);
    News::create([
      'title' => [
        'ar' => 'مشروع تحديث أنظمة البنك',
        'en' => 'english',
      ],
      'description' => [
        'ar' => 'هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى هذا النص هو مثال لنص يمكن أن يستبدل',
        'en' => 'english',
      ],
      'image' => '16582236787836878523589890043228.jpg',
    ]);
    News::create([
      'title' => [
        'ar' => 'مشروع تحديث أنظمة البنك',
        'en' => 'english',
      ],
      'description' => [
        'ar' => 'هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى هذا النص هو مثال لنص يمكن أن يستبدل',
        'en' => 'english',
      ],
      'image' => '16582236787836878523589890043228.jpg',
    ]);
  }
}
