<?php

namespace Database\Seeders;

use App\Models\Service;
use App\Models\ServiceAdvantage;
use App\Models\SuccessStory;
use App\Models\SuccessStoryImage;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class ServicesSeeder extends Seeder
{
  /**
   * Run the database seeds.
   *
   * @return void
   */
  public function run()
  {
    $loremText = 'هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى هذا النص هو مثال لنص يمكن أن يستبدل';


    Service::create([
      'title'               => ['ar' => "خدمات الأفراد", 'en' => "خدمات الأفراد"],
      'description'         => ['ar' => 'هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى هذا النص هو مثال لنص يمكن أن يستبدل'],
      'image'               => 'atm.png',
      'is_main_service'     => true
    ]);

    Service::create([
      'title'               => ['ar' => "خدمات الشركات", 'en' => "خدمات الشركات"],
      'description'         => ['ar' => 'هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى هذا النص هو مثال لنص يمكن أن يستبدل'],
      'image'               => 'atm.png',
      'is_main_service'     => true
    ]);

    Service::create([
      'title'               => ['ar' => "كريمي اكسبرس", 'en' => "كريمي اكسبرس"],
      'description'         => ['ar' => 'هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى هذا النص هو مثال لنص يمكن أن يستبدل'],
      'image'               => 'atm.png',
      'is_main_service'     => true
    ]);

    $serviceFinance  = Service::create([
      'title'               => ['ar' => "أم فلوس", 'en' => "أم فلوس"],
      'description'         => ['ar' => 'هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى هذا النص هو مثال لنص يمكن أن يستبدل'],
      'image'               => 'atm.png',
      'is_main_service'     => true
    ]);

    Service::create([
      'title'               => ['ar' => "التمويل", 'en' => "التمويل"],
      'description'         => ['ar' => $loremText, 'en' => $loremText],
      'image'               => 'atm.png',
      'is_main_service'     => true
    ]);

    Service::create([
      'title'               => ["ar" => "تطبيقات البنك", "en" => "تطبيقات البنك"],
      'description'         => ['ar' => $loremText, 'en' => $loremText],
      'image'               => 'atm.png',
      'is_main_service'     => true
    ]);


    /***********************************************************/
    $service = Service::create([
      'title' => [
        'ar' => 'مشروعي',
        'en' => 'مشروعي',
      ],
      'description' => [
        'ar' => 'بتمويلات تصل إلى 50 مليون ريال يمني، تخيل ماذا يمكنك أن تفعل لتطوير مشروعك؟ بنك الكريمي للتمويل الأصغر الإسلامي يساعدك لتجيب عن هذا التساؤل',
        'en' => 'بتمويلات تصل إلى 50 مليون ريال يمني، تخيل ماذا يمكنك أن تفعل لتطوير مشروعك؟ بنك الكريمي للتمويل الأصغر الإسلامي يساعدك لتجيب عن هذا التساؤل'
      ],
      'image' => 'atm.png',

      'other_advantage' => [
        'ar' => 'السحب مجاناً عبر شبكة الصرَّافات الآلية الخاصة بـ بنك الكريمي للتمويل الأصغر الإسلامي
      على مدار الساعة وطوال أيام الأسبوع
      إمكانيَّة سحب واستلام الحوالات مباشرة عبر خدمة الصرَّاف الآلي وبدون أي
      بطاقة
      يستطيع العميل إيداع حوالته إلى حسابه مباشرة عبر خدمة الصرَّاف الآلي
      إمكانيَّة التحويل إلى أي حساب في بنك الكريمي للتمويل الأصغر الإسلامي
      سبأفون - سداد الهاتف الثابت - سداد -Y - YOU - يمن موبايل) سداد فواتير الخدمات
      (فواتير الكهرباء - فواتير الماء- adsl الانترنت فايبر
      تغيير كلمة المرور في الصرَّافات التابعة لبنك للتمويل الأصغر الإسلامي
      الإيداع النقدي للحساب في الصرَّافات الآلية التي تدعم ذلك
      طلب كشف حساب مختصر او الاستعلام عن الرصيد',
        'en' => 'english'
      ],

      'service_conditions' => [
        'ar' => 'السحب مجاناً عبر شبكة الصرَّافات الآلية الخاصة بـ بنك الكريمي للتمويل الأصغر الإسلامي
        على مدار الساعة وطوال أيام الأسبوع
        إمكانيَّة سحب واستلام الحوالات مباشرة عبر خدمة الصرَّاف الآلي وبدون أي
        بطاقة
        يستطيع العميل إيداع حوالته إلى حسابه مباشرة عبر خدمة الصرَّاف الآلي
        إمكانيَّة التحويل إلى أي حساب في بنك الكريمي للتمويل الأصغر الإسلامي
        سبأفون - سداد الهاتف الثابت - سداد -Y - YOU - يمن موبايل) سداد فواتير الخدمات
        (فواتير الكهرباء - فواتير الماء- adsl الانترنت فايبر
        تغيير كلمة المرور في الصرَّافات التابعة لبنك للتمويل الأصغر الإسلامي
        الإيداع النقدي للحساب في الصرَّافات الآلية التي تدعم ذلك
        طلب كشف حساب مختصر او الاستعلام عن الرصيد',
        'en' => 'english'
      ],

      'subscription_in_service' => [
        'ar' => 'السحب مجاناً عبر شبكة الصرَّافات الآلية الخاصة بـ بنك الكريمي للتمويل الأصغر الإسلامي
        على مدار الساعة وطوال أيام الأسبوع
        إمكانيَّة سحب واستلام الحوالات مباشرة عبر خدمة الصرَّاف الآلي وبدون أي
        بطاقة
        يستطيع العميل إيداع حوالته إلى حسابه مباشرة عبر خدمة الصرَّاف الآلي
        إمكانيَّة التحويل إلى أي حساب في بنك الكريمي للتمويل الأصغر الإسلامي
        سبأفون - سداد الهاتف الثابت - سداد -Y - YOU - يمن موبايل) سداد فواتير الخدمات
        (فواتير الكهرباء - فواتير الماء- adsl الانترنت فايبر
        تغيير كلمة المرور في الصرَّافات التابعة لبنك للتمويل الأصغر الإسلامي
        الإيداع النقدي للحساب في الصرَّافات الآلية التي تدعم ذلك
        طلب كشف حساب مختصر او الاستعلام عن الرصيد',
        'en' => 'english'
      ],

      'questions' => [
        'ar' => 'السحب مجاناً عبر شبكة الصرَّافات الآلية الخاصة بـ بنك الكريمي للتمويل الأصغر الإسلامي
        على مدار الساعة وطوال أيام الأسبوع
        إمكانيَّة سحب واستلام الحوالات مباشرة عبر خدمة الصرَّاف الآلي وبدون أي
        بطاقة
        يستطيع العميل إيداع حوالته إلى حسابه مباشرة عبر خدمة الصرَّاف الآلي
        إمكانيَّة التحويل إلى أي حساب في بنك الكريمي للتمويل الأصغر الإسلامي
        سبأفون - سداد الهاتف الثابت - سداد -Y - YOU - يمن موبايل) سداد فواتير الخدمات
        (فواتير الكهرباء - فواتير الماء- adsl الانترنت فايبر
        تغيير كلمة المرور في الصرَّافات التابعة لبنك للتمويل الأصغر الإسلامي
        الإيداع النقدي للحساب في الصرَّافات الآلية التي تدعم ذلك
        طلب كشف حساب مختصر او الاستعلام عن الرصيد',
        'en' => 'english'
      ],

      'service_slogan' => [
        'ar' => 'خدمة مشروعي تتيح لك الفرصة <br />لتحسين مشروعك الخاص وتطويره',
        'en' => 'en'
      ],

      'service_id' => $serviceFinance->id
    ]);

    ServiceAdvantage::create([
      'title' => [
        'ar' => 'تراعي طبيعة دخلك',
        'en' => 'تراعي طبيعة دخلك',
      ],
      'description' => [
        'ar' => 'تراعي طبيعة دخلك وأقساطها مريحة (شهرية موسمية)',
        'en' => 'تراعي طبيعة دخلك وأقساطها مريحة (شهرية موسمية)',
      ],

      'service_id' => $service->id
    ]);

    ServiceAdvantage::create([
      'title' => [
        'ar' => 'تراعي إمكانياتك',
        'en' => 'تراعي إمكانياتك',
      ],
      'description' => [
        'ar' => 'تراعي إمكانياتك بضمانات بسيطة وميسرة',
        'en' => 'تراعي إمكانياتك بضمانات بسيطة وميسرة',
      ],

      'service_id' => $service->id
    ]);

    ServiceAdvantage::create([
      'title' => [
        'ar' => 'دراسة مالية واقتصادية',
        'en' => 'دراسة مالية واقتصادية',
      ],
      'description' => [
        'ar' => 'تقدم لك دراسة مالية واقتصادية لمشروعك تستطيع من خلالها الحصول عل تقييم حقيقي .لإدارة مشروعك',
        'en' => 'تقدم لك دراسة مالية واقتصادية لمشروعك تستطيع من خلالها الحصول عل تقييم حقيقي .لإدارة مشروعك',
      ],

      'service_id' => $service->id
    ]);

    $story = SuccessStory::create([
      'title' => [
        'ar' => 'دراسة مالية واقتصادية',
        'en' => 'دراسة مالية واقتصادية',
      ],
      'description' => [
        'ar' => $loremText,
        'en' => $loremText,
      ],

      'service_id' => $service->id
    ]);

    SuccessStoryImage::insert([
      'link' => 'story.png',
      'success_story_id' => $story->id
    ]);

    $story = SuccessStory::create([
      'title' => [
        'ar' => 'مشروع تحديث أنظمة البنك',
        'en' => 'مشروع تحديث أنظمة البنك',
      ],
      'description' => [
        'ar' => $loremText,
        'en' => $loremText,
      ],

      'service_id' => $service->id
    ]);

    SuccessStoryImage::insert([
      'link' => 'story.png',
      'success_story_id' => $story->id
    ]);
    /***********************************************************/


    /***********************************************************/
    $service = Service::create([
      'title' => [
        'ar' => 'تمويل المساكن',
        'en' => 'Home Finance',
      ],
      'description' => [
        'ar' => 'هل لديك بيت وتسعى إلى ترميمه – هل واجهت مشكلة أثناء استكمال بناء منزلك بسبب التمويل .. نقدم لكم منتج تمويل المساكن من بنك الكريمي للتمويل الأصغر الإسلامي لكل ما يتعلق بتحسين أو بناء سكن لكل صاحب دخل (صاحب منشاة ،مؤجر ،موظف أو متقاعد).',
        'en' => 'Do you have a house and you are seeking to restore it - did you face a problem while completing the construction of your house because of the financing .. We offer you a home financing product from Al-Kuraimi Islamic Microfinance Bank for everything related to improving or building a housing for each income owner (establishment owner, renter, employee or retiree).'
      ],
      'image' => 'service-house-money.webp',

      'other_advantage' => [
        'ar' => 'السحب مجاناً عبر شبكة الصرَّافات الآلية الخاصة بـ بنك الكريمي للتمويل الأصغر الإسلامي
      على مدار الساعة وطوال أيام الأسبوع
      إمكانيَّة سحب واستلام الحوالات مباشرة عبر خدمة الصرَّاف الآلي وبدون أي
      بطاقة
      يستطيع العميل إيداع حوالته إلى حسابه مباشرة عبر خدمة الصرَّاف الآلي
      إمكانيَّة التحويل إلى أي حساب في بنك الكريمي للتمويل الأصغر الإسلامي
      سبأفون - سداد الهاتف الثابت - سداد -Y - YOU - يمن موبايل) سداد فواتير الخدمات
      (فواتير الكهرباء - فواتير الماء- adsl الانترنت فايبر
      تغيير كلمة المرور في الصرَّافات التابعة لبنك للتمويل الأصغر الإسلامي
      الإيداع النقدي للحساب في الصرَّافات الآلية التي تدعم ذلك
      طلب كشف حساب مختصر او الاستعلام عن الرصيد',
        'en' => 'english'
      ],

      'service_conditions' => [
        'ar' => 'السحب مجاناً عبر شبكة الصرَّافات الآلية الخاصة بـ بنك الكريمي للتمويل الأصغر الإسلامي
        على مدار الساعة وطوال أيام الأسبوع
        إمكانيَّة سحب واستلام الحوالات مباشرة عبر خدمة الصرَّاف الآلي وبدون أي
        بطاقة
        يستطيع العميل إيداع حوالته إلى حسابه مباشرة عبر خدمة الصرَّاف الآلي
        إمكانيَّة التحويل إلى أي حساب في بنك الكريمي للتمويل الأصغر الإسلامي
        سبأفون - سداد الهاتف الثابت - سداد -Y - YOU - يمن موبايل) سداد فواتير الخدمات
        (فواتير الكهرباء - فواتير الماء- adsl الانترنت فايبر
        تغيير كلمة المرور في الصرَّافات التابعة لبنك للتمويل الأصغر الإسلامي
        الإيداع النقدي للحساب في الصرَّافات الآلية التي تدعم ذلك
        طلب كشف حساب مختصر او الاستعلام عن الرصيد',
        'en' => 'english'
      ],

      'subscription_in_service' => [
        'ar' => 'السحب مجاناً عبر شبكة الصرَّافات الآلية الخاصة بـ بنك الكريمي للتمويل الأصغر الإسلامي
        على مدار الساعة وطوال أيام الأسبوع
        إمكانيَّة سحب واستلام الحوالات مباشرة عبر خدمة الصرَّاف الآلي وبدون أي
        بطاقة
        يستطيع العميل إيداع حوالته إلى حسابه مباشرة عبر خدمة الصرَّاف الآلي
        إمكانيَّة التحويل إلى أي حساب في بنك الكريمي للتمويل الأصغر الإسلامي
        سبأفون - سداد الهاتف الثابت - سداد -Y - YOU - يمن موبايل) سداد فواتير الخدمات
        (فواتير الكهرباء - فواتير الماء- adsl الانترنت فايبر
        تغيير كلمة المرور في الصرَّافات التابعة لبنك للتمويل الأصغر الإسلامي
        الإيداع النقدي للحساب في الصرَّافات الآلية التي تدعم ذلك
        طلب كشف حساب مختصر او الاستعلام عن الرصيد',
        'en' => 'english'
      ],

      'questions' => [
        'ar' => 'السحب مجاناً عبر شبكة الصرَّافات الآلية الخاصة بـ بنك الكريمي للتمويل الأصغر الإسلامي
        على مدار الساعة وطوال أيام الأسبوع
        إمكانيَّة سحب واستلام الحوالات مباشرة عبر خدمة الصرَّاف الآلي وبدون أي
        بطاقة
        يستطيع العميل إيداع حوالته إلى حسابه مباشرة عبر خدمة الصرَّاف الآلي
        إمكانيَّة التحويل إلى أي حساب في بنك الكريمي للتمويل الأصغر الإسلامي
        سبأفون - سداد الهاتف الثابت - سداد -Y - YOU - يمن موبايل) سداد فواتير الخدمات
        (فواتير الكهرباء - فواتير الماء- adsl الانترنت فايبر
        تغيير كلمة المرور في الصرَّافات التابعة لبنك للتمويل الأصغر الإسلامي
        الإيداع النقدي للحساب في الصرَّافات الآلية التي تدعم ذلك
        طلب كشف حساب مختصر او الاستعلام عن الرصيد',
        'en' => 'english'
      ],

      'service_slogan' => [
        'ar' => 'خدمة مشروعي تتيح لك الفرصة <br />لتحسين مشروعك الخاص وتطويره',
        'en' => 'en'
      ],

      'service_id' => $serviceFinance->id
    ]);

    ServiceAdvantage::create([
      'title' => [
        'ar' => 'تراعي طبيعة دخلك',
        'en' => 'تراعي طبيعة دخلك',
      ],
      'description' => [
        'ar' => 'تراعي طبيعة دخلك وأقساطها مريحة (شهرية موسمية)',
        'en' => 'تراعي طبيعة دخلك وأقساطها مريحة (شهرية موسمية)',
      ],

      'service_id' => $service->id
    ]);

    ServiceAdvantage::create([
      'title' => [
        'ar' => 'تراعي إمكانياتك',
        'en' => 'تراعي إمكانياتك',
      ],
      'description' => [
        'ar' => 'تراعي إمكانياتك بضمانات بسيطة وميسرة',
        'en' => 'تراعي إمكانياتك بضمانات بسيطة وميسرة',
      ],

      'service_id' => $service->id
    ]);

    ServiceAdvantage::create([
      'title' => [
        'ar' => 'دراسة مالية واقتصادية',
        'en' => 'دراسة مالية واقتصادية',
      ],
      'description' => [
        'ar' => 'تقدم لك دراسة مالية واقتصادية لمشروعك تستطيع من خلالها الحصول عل تقييم حقيقي .لإدارة مشروعك',
        'en' => 'تقدم لك دراسة مالية واقتصادية لمشروعك تستطيع من خلالها الحصول عل تقييم حقيقي .لإدارة مشروعك',
      ],

      'service_id' => $service->id
    ]);

    $story = SuccessStory::create([
      'title' => [
        'ar' => 'دراسة مالية واقتصادية',
        'en' => 'دراسة مالية واقتصادية',
      ],
      'description' => [
        'ar' => $loremText,
        'en' => $loremText,
      ],

      'service_id' => $service->id
    ]);

    SuccessStoryImage::insert([
      'link' => 'story.png',
      'success_story_id' => $story->id
    ]);

    $story = SuccessStory::create([
      'title' => [
        'ar' => 'مشروع تحديث أنظمة البنك',
        'en' => 'مشروع تحديث أنظمة البنك',
      ],
      'description' => [
        'ar' => $loremText,
        'en' => $loremText,
      ],

      'service_id' => $service->id
    ]);

    SuccessStoryImage::insert([
      'link' => 'story.png',
      'success_story_id' => $story->id
    ]);
    /***********************************************************/
  }
}
